title: SSH Brute Force
id: 423d4010-c225-4943-9668-ab54fccf02d4
status: experimental
description: Detects SSH brute force/password cracking attempts with tool Hydra. Hydra has different modules to conduct brute force on, SSH is one of those modules.
references:
    - A list of all references that can help a reader or analyst understand the meaning of a triggered rule
    - https://www.hackingarticles.in/a-detailed-guide-on-hydra/
    - https://medium.com/@Aircon/hydra-tool-tryhackme-24519e924746
    - https://github.com/vanhauser-thc/thc-hydra
tags:
    - attack.brute.force  # example MITRE ATT&CK category
    - attack.t1110      # example MITRE ATT&CK technique id
    - attack.t1110.001
    - attack.t1110.002# example CAR id
author: Mr-Zero007  # example, a list of authors
date: 2023/01/30  # Rule date
logsource:                      # important for the field mapping in predefined or your additional config files
    category: brute force  # In thttps://github.com/vanhauser-thc/thc-hydrahttps://github.com/vanhauser-thc/thc-hydrahis example we choose the category 'process_creation'
    product: linux            # the respective product
detection:
    selection:
        EventLog: Security
        FieldName: 4625
        FieldName|modifier: 'Value'
    condition: selection
fields:
    - fields in the log source that are important to investigate further
falsepositives:
    - describe possible false positive conditions to help the analysts in their investigation
level: one of five levels (informational, low, medium, high, critical)
